# 0和重复的元素只是为了控制概率
test = {
    'description':'无',
    'six_up':['Aup',0],
    'five_up':['Bup',0],
    'six_stars':['A1','A2','A3'],
    'five_stars':['B1','B2','B3'],
    'four_stars':['C1','C2','C3','C4'],
    'three_stars':['D1','D2','D3','D4','D5'],
    }

# 这个池子没有up！
test2 = {
    'description':'这个池子没有up！',
    'six_up':[0],
    'five_up':[0],
    'six_stars':['能天使','黑','安洁莉娜','银灰','莫斯提马','夜莺','星熊','陈',
        '阿','煌','麦哲伦','赫拉格','斯卡蒂','塞雷娅','闪灵','艾雅法拉','伊芙利特',
        '推进之王','刻俄柏','风笛','傀影','温蒂','早露','铃兰','棘刺','森蚺',
        '史尔特尔','瑕光','泥岩','山','空弦','嵯峨','异客','凯尔希','夕','年',
        'W','迷迭香','浊心斯卡蒂'],
    'five_stars':['狮蝎','食铁兽','蓝毒','拉普兰德','幽灵鲨','德克萨斯','槐琥',
        '赫默','红','白面鸮','空','吽','灰喉','布洛卡','苇草','送葬人','星极',
        '格劳克斯','诗怀雅','夜魔','真理','初雪','崖心','守林人','普罗旺斯','可颂',
        '雷蛇','临光','华法琳','梅尔','天火','陨星','白金','芙兰卡','凛冬','惊蛰',
        '慑砂','巫恋','极境','石棉','月禾','莱恩哈特','断崖','蜜蜡','贾维','安哲拉',
        '燧石','四月','奥斯塔','絮雨','卡夫卡','爱丽丝','乌有','熔泉','赤冬'],
    'four_stars':['安比尔','梅','红云','桃金娘','苏苏洛','格雷伊','猎蜂','阿消',
       '地灵','深海色','古米','蛇屠箱','角峰','调香师','末药','暗索','砾','慕斯',
       '霜叶','缠丸','杜宾','红豆','清道夫','白雪','流星','杰西卡','远山','夜烟',
        '宴','刻刀','波登可','卡达','孑','酸糖','芳汀','泡泡','杰克','松果','豆苗'],
    'three_stars':['芬','炎熔','月见夜','香草','史都华德','卡缇','米格鲁','斑点',
        '空爆','梓兰','芙蓉','克洛丝','玫兰莎','翎羽','泡普卡','安赛尔'],
    }

# '浊心斯卡蒂'和'凯尔希'占六星出率的70%，'W'在剩余出率中以5倍权值出率提升
#  '赤冬'占五星出率的50%
深悼 = {
    'description':"'浊心斯卡蒂'和'凯尔希'占六星出率的70%，"+
        "'W'在剩余出率中以5倍权值出率提升;\n"+
        "'赤冬'占五星出率的50%",
    'six_up':['浊心斯卡蒂','凯尔希','浊心斯卡蒂','凯尔希','浊心斯卡蒂','凯尔希',
        '浊心斯卡蒂','凯尔希','浊心斯卡蒂','凯尔希','浊心斯卡蒂','凯尔希',
        '浊心斯卡蒂','凯尔希',
        0,0,0,0,0,0],
    'five_up':['赤冬',0],
    'six_stars':['能天使','推进之王','伊芙利特','艾雅法拉','安洁莉娜','闪灵',
        '夜莺','星熊','塞雷娅','银灰','斯卡蒂','陈','黑','赫拉格','麦哲伦',
        '莫斯提马','煌','阿','刻俄柏','风笛','傀影','温蒂','早露','铃兰','棘刺',
        '森蚺','史尔特尔','瑕光','泥岩','山','空弦','嵯峨','异客',
        'W','W','W','W','W'],
    'five_stars':['白面鸮','凛冬','德克萨斯','芙兰卡','拉普兰德','幽灵鲨','蓝毒',
        '白金','陨星','天火','梅尔','赫默','华法琳','临光','红','雷蛇','可颂',
        '普罗旺斯','守林人','崖心','初雪','真理','空','狮竭','食铁兽','夜魔',
        '诗怀雅','格劳克斯','星极','送葬人','槐琥','苇草','布洛卡','灰喉','吽',
        '惊蛰','慑砂','巫恋','极境','石棉','月禾','莱恩哈特','断崖','蜜蜡','贾维',
        '安哲拉','燧石','四月','奥斯塔','絮雨','卡夫卡','爱丽丝','乌有','熔泉'],
    'four_stars':['夜烟','远山','杰西卡','流星','白雪','清道夫','红豆','杜宾',
        '缠丸','霜叶','慕斯','砾','暗索','末药','调香师','角峰','蛇屠箱','古米',
        '深海色','地灵','阿消','猎蜂','格雷伊','苏苏洛','桃金娘','红云','梅',
        '安比尔','宴','刻刀','波登可','卡达','孑','酸糖','芳汀','泡泡','杰克',
        '松果','豆苗'],
    'three_stars':['芬','香草','翎羽','玫兰莎','卡缇','米格鲁','克洛丝','炎熔',
        '芙蓉','安赛尔','史都华德','梓兰','空爆','月见夜','班点','泡普卡'],
    }

阿and森蚺 = {
    'description':"'阿'和'森蚺'占六星出率的50%;\n"+
        "'白面鸮'、'蓝毒'和'真理'占五星出率的50%",
    'six_up':['阿','森蚺',0,0],
    'five_up':['白面鸮','蓝毒','真理',0,0,0],
    'six_stars':['能天使','黑','安洁莉娜','银灰','莫斯提马','夜莺','星熊','陈',
        '阿','煌','麦哲伦','赫拉格','斯卡蒂','塞雷娅','闪灵','艾雅法拉','伊芙利特',
        '推进之王','刻俄柏','风笛','傀影','温蒂','早露','铃兰','棘刺','森蚺',
        '史尔特尔','瑕光','泥岩','山','空弦','嵯峨','异客','凯尔希'],
    'five_stars':['狮蝎','食铁兽','蓝毒','拉普兰德','幽灵鲨','德克萨斯','槐琥',
        '赫默','红','白面鸮','空','吽','灰喉','布洛卡','苇草','送葬人','星极',
        '格劳克斯','诗怀雅','夜魔','真理','初雪','崖心','守林人','普罗旺斯','可颂',
        '雷蛇','临光','华法琳','梅尔','天火','陨星','白金','芙兰卡','凛冬','惊蛰',
        '慑砂','巫恋','极境','石棉','月禾','莱恩哈特','断崖','蜜蜡','贾维','安哲拉',
        '燧石','四月','奥斯塔','絮雨','卡夫卡','爱丽丝','乌有','熔泉','赤冬'],
    'four_stars':['安比尔','梅','红云','桃金娘','苏苏洛','格雷伊','猎蜂','阿消',
       '地灵','深海色','古米','蛇屠箱','角峰','调香师','末药','暗索','砾','慕斯',
       '霜叶','缠丸','杜宾','红豆','清道夫','白雪','流星','杰西卡','远山','夜烟',
        '宴','刻刀','波登可','卡达','孑','酸糖','芳汀','泡泡','杰克','松果','豆苗'],
    'three_stars':['芬','炎熔','月见夜','香草','史都华德','卡缇','米格鲁','斑点',
        '空爆','梓兰','芙蓉','克洛丝','玫兰莎','翎羽','泡普卡','安赛尔'],
    }

联合行动 = {
    'description':'特选干员定向寻访',
    'six_up':[0],
    'five_up':[0],
    'six_stars':['夜莺','温蒂','铃兰','棘刺'],
    'five_stars':['芙兰卡','赫默','临光','极境','莱恩哈特','安哲拉'],
    'four_stars':['安比尔','梅','红云','桃金娘','苏苏洛','格雷伊','猎蜂','阿消',
       '地灵','深海色','古米','蛇屠箱','角峰','调香师','末药','暗索','砾','慕斯',
       '霜叶','缠丸','杜宾','红豆','清道夫','白雪','流星','杰西卡','远山','夜烟',
        '宴','刻刀','波登可','卡达','孑','酸糖','芳汀','泡泡','杰克','松果','豆苗'],
    'three_stars':['芬','炎熔','月见夜','香草','史都华德','卡缇','米格鲁','斑点',
        '空爆','梓兰','芙蓉','克洛丝','玫兰莎','翎羽','泡普卡','安赛尔'],
    }

艾雅法拉and史尔特尔 = {
    'description':"'艾雅法拉'和'史尔特尔'占六星出率的50%;\n"+
        "'凛冬'、'槐琥'和'华法琳'占五星出率的50%",
    'six_up':['艾雅法拉','史尔特尔',0,0],
    'five_up':['凛冬','槐琥','华法琳',0,0,0],
    'six_stars':['能天使','黑','安洁莉娜','银灰','莫斯提马','夜莺','星熊','陈',
        '阿','煌','麦哲伦','赫拉格','斯卡蒂','塞雷娅','闪灵','艾雅法拉','伊芙利特',
        '推进之王','刻俄柏','风笛','傀影','温蒂','早露','铃兰','棘刺','森蚺',
        '史尔特尔','瑕光','泥岩','山','空弦','嵯峨','异客','凯尔希'],
    'five_stars':['狮蝎','食铁兽','蓝毒','拉普兰德','幽灵鲨','德克萨斯','槐琥',
        '赫默','红','白面鸮','空','吽','灰喉','布洛卡','苇草','送葬人','星极',
        '格劳克斯','诗怀雅','夜魔','真理','初雪','崖心','守林人','普罗旺斯','可颂',
        '雷蛇','临光','华法琳','梅尔','天火','陨星','白金','芙兰卡','凛冬','惊蛰',
        '慑砂','巫恋','极境','石棉','月禾','莱恩哈特','断崖','蜜蜡','贾维','安哲拉',
        '燧石','四月','奥斯塔','絮雨','卡夫卡','爱丽丝','乌有','熔泉','赤冬'],
    'four_stars':['安比尔','梅','红云','桃金娘','苏苏洛','格雷伊','猎蜂','阿消',
       '地灵','深海色','古米','蛇屠箱','角峰','调香师','末药','暗索','砾','慕斯',
       '霜叶','缠丸','杜宾','红豆','清道夫','白雪','流星','杰西卡','远山','夜烟',
        '宴','刻刀','波登可','卡达','孑','酸糖','芳汀','泡泡','杰克','松果','豆苗'],
    'three_stars':['芬','炎熔','月见夜','香草','史都华德','卡缇','米格鲁','斑点',
        '空爆','梓兰','芙蓉','克洛丝','玫兰莎','翎羽','泡普卡','安赛尔'],
    }

不协和音程 = {
    'description':"'黑键'占六星出率的50%;\n"+
        "'濯尘芙蓉'和'蓝毒'占五星出率的50%",
    'six_up':['黑键',0],
    'five_up':['濯尘芙蓉','蓝毒',0,0],
    'six_stars':['能天使','黑','安洁莉娜','银灰','莫斯提马','夜莺','星熊','陈',
        '阿','煌','麦哲伦','赫拉格','斯卡蒂','塞雷娅','闪灵','艾雅法拉','伊芙利特',
        '推进之王','刻俄柏','风笛','傀影','温蒂','早露','铃兰','棘刺','森蚺',
        '史尔特尔','瑕光','泥岩','山','空弦','嵯峨','异客','凯尔希','卡涅利安',
        '帕拉斯','水月','琴柳','远牙','焰尾','灵知','老鲤','澄闪','菲亚梅塔',
        '号角','艾丽妮','黑键'],
    'five_stars':['狮蝎','食铁兽','蓝毒','拉普兰德','幽灵鲨','德克萨斯','槐琥',
        '赫默','红','白面鸮','空','吽','灰喉','布洛卡','苇草','送葬人','星极',
        '格劳克斯','诗怀雅','夜魔','真理','初雪','崖心','守林人','普罗旺斯',
        '可颂','雷蛇','临光','华法琳','梅尔','天火','陨星','白金','芙兰卡',
        '凛冬','惊蛰','慑砂','巫恋','极境','石棉','月禾','莱恩哈特','断崖',
        '蜜蜡','贾维','安哲拉','燧石','四月','奥斯塔','絮雨','卡夫卡','爱丽丝',
        '乌有','熔泉','赤冬','绮良','羽毛笔','桑葚','灰毫','蚀清','极光','夜半',
        '夏栎','风丸','洛洛','掠风','濯尘芙蓉'],
    'four_stars':['安比尔','梅','红云','桃金娘','苏苏洛','格雷伊','猎蜂','阿消',
        '地灵','深海色','古米','蛇屠箱','角峰','调香师','末药','暗索','砾',
        '慕斯','霜叶','缠丸','杜宾','红豆','清道夫','白雪','流星','杰西卡',
        '远山','夜烟','宴','刻刀','波登可','卡达','孑','酸糖','芳汀','泡泡',
        '杰克','松果','豆苗','深靛','罗比菈塔','褐果'],
    'three_stars':['芬','炎熔','月见夜','香草','史都华德','卡缇','米格鲁','斑点',
        '空爆','梓兰','芙蓉','克洛丝','玫兰莎','翎羽','泡普卡','安赛尔'],
    }

pools = ['test','terst2','深悼','阿and森蚺','联合行动','艾雅法拉and史尔特尔','不协和音程']